---
kind: type
id: T:Autodesk.Revit.DB.RoutingCriterionBase
source: html/6164e8ca-7eb1-2207-c596-d129e1aa146d.htm
---
# Autodesk.Revit.DB.RoutingCriterionBase

RoutingCriteriaBase is the base class for all routing criteria.

## Syntax (C#)
```csharp
public class RoutingCriterionBase : IDisposable
```